documents/Learning GNU Emacs 3rd/chapter02/chapter2.5.org
#+title: 2.5. 编辑窍门和技巧

你已经学习了基本编辑操作--移动光标到正确的位置，删除，复制和移动文本--
你可以学习一些技巧让编辑更容易。

*2.5.1 处理字符换位*

最常见的排版工作就是互换两个字符的位置，并且大部分情况下，都是在你输入
后马上就发现了。按 *C-t* 互换两个字符的位置，并将他们正确排序：
|   | 按 *C-t* 之前            | 按 *C-t* 之后            |
|---+--------------------------+------------------------|
| / | <>                       | <>                     |
|---+--------------------------+------------------------|
| # | the best of tims _e_, it | the best of times_  it |


互换字符时，将光标移动到要互换位置的两个字符的第二个字符上，按 *C-t*。
（如果你经常要互换字符，第三章介绍的单词缩略模式会自动修正排版错误。）

也可以互换两个单词，行，段或句子。要互换两个单词，先将光标移动到两词之
间再按 *M-t* 。Emacs执行完成后，光标会移动第二个（移动后的）单词后面。

|   | 按 *M-t* 之前   | 按 *M-t* 之后 |
|---+-----------------+---------------|
| / | <>              | <>            |
|---+-----------------+---------------|
| # | one three\_two  | one two three_ |

有趣的是，Emacs只移动单词，不移动标点。 以互换两个名字为例：

|   | 按 *M-t* 之前    | 按 *M-t* 之后 |
|---+------------------+---------------|
| / | <>               | <>            |
|---+------------------+---------------|
| # | Charles, _D_ ickens | Dickens, Charles\_            |

要移动两行，先将光标移动到第二行的任意位置然后按 *C-x C-t* 。Emacs会将
第二行移动到第一行前面：

|   | 按 *C-x C-t* 之前 | 按 *C-x C-t* 之后 |
|---+-------------------+-------------------|
| / | <>                | <>                |
|---+-------------------+-------------------|
| # | second line       | first line        |
| # | first line        | second line       |
| # | third line        | third line                  |

表 2-9 总结了移位指令

#+CAPTION: *表 2-9. 移位指令*
|   | 快捷键    | 指令名称               | 功能           |
|---+-----------+------------------------+----------------|
| / | <>        | <>                     | <>             |
|---+-----------+------------------------+----------------|
| # | *C-t*     | *transpose-chars*      | 互换两个字符。 |
|---+-----------+------------------------+----------------|
| # | *M-t*     | *transpose-words*      | 互换两个单词。 |
|---+-----------+------------------------+----------------|
| # | *C-x C-t* | *transpose-lines*      | 互换两行。     |
|---+-----------+------------------------+----------------|
| # | （无）    | *transpose-sentences*  | 互换两个句子。 |
|---+-----------+------------------------+----------------|
| # | （无）    | *transpose-paragraphs* | 互换两段。     |

*2.5.2 转换大小写*

大写错误也是常见并且烦人的输入错误。Emacs有一些特殊的指令来处理大写问
题。要将单词的第一个字母变成大写，先将光标移动到单词的首字符，然后按
*M-c* 。要将单词变成小写，按 *M-l* 。要将一个单词变成大写，按 *M-u* 。
按键绑定是有助于记忆的： *Meta* 后面的 *c* 表示大写（capitalize)， *l*
表示小写（lowercase)， *u* 表示全部大写（uppercase)。需要注意的是，如
果光标在一个单词的中间，操作仅对光标下的字符至单词结尾部分启作用。你可
以很容易地用 *M-l* 将单词的后半部分变成小写，依此类推。


如果你发现刚输入的单词不正确，在使用指令前先按 *Meta-* （按住 *Meta*
并按连字符）。这样可以修正之前的单词而不移动光标。如果光标在单词的中
间，在执行指令前按 *M-* 会操作单词的前半部分（光标之前的部分），而不是
光标之后的部分。


例如，以 abcd _e_ fghi:
|   | 如果你按：   | 将得到：   |
|---+--------------+------------|
| / | <>           | <>         |
|---+--------------+------------|
| # | *Meta - u*   | abcdEFGHIJ |
|---+--------------+------------|
| # | *Meta - M-u* | ABCDefghij |
|---+--------------+------------|
| # | *M-c*        | abcdEfghij |
|---+--------------+------------|
| # | *Meta - M-c* | Abcdefghij |

表 2-10 总结了大小写指令

#+CAPTION: *表2-10. 大小写指令*
|---+--------------+--------------------------------------+----------------------|
|   | 快捷键       | 指令名                               | 功能                 |
|---+--------------+--------------------------------------+----------------------|
| / | <>           | <>                                   | <>                   |
|---+--------------+--------------------------------------+----------------------|
| # | *M-c*        | *capitalize-word*                    | 大写单词第一个字母   |
|---+--------------+--------------------------------------+----------------------|
| # | *M-u*        | *upcase-word*                        | 大写单词             |
|---+--------------+--------------------------------------+----------------------|
| # | *M-l*        | *downcase-word*                      | 小写单词             |
|---+--------------+--------------------------------------+----------------------|
| # | *Meta - M-c* | *negative-argument; capitalize-word* | 大写前一单词的首字母 |
|---+--------------+--------------------------------------+----------------------|
| # | *Meta - M-u* | *negative-argument; upcase-word*     | 大写前一单词         |
|---+--------------+--------------------------------------+----------------------|
| # | *Meta - M-l* | *negative-argument; downcase-word*   | 小写前一字母         |
|---+--------------+--------------------------------------+----------------------|

*2.5.3 改写模式*

你或许习惯于直接输入来覆盖原文本而不是删除。这样删除错误的文本的确比较
方便。进入名为 *overwirte* 的副模式，你也可以在Emacs中这样做。当进入改
写模式下,任何输入的新文本都会擦除其下面的文本。当你不在改写模式下时
（如，在Emacs的正常情况下），任何新输入的文本都会插入到光标位置且后面
的文本会向右移。（其他软件可能称此为插入模式；因为Emacs一般情况下就是
如此，所以它没有特殊的名字）。

要进入改写模式，按 *Insert* 键。[fn:1] *Ovwrt* 会在模式行显示。如果这
样不起作用（或者你没有 *Insert* 键），可以输入 *M-x overwrite-mode
Enter* 。再次输入 *M-x overwrite-mode Enter* 可以关闭改写模式。使用
Emacs的指令完成功能，只要输入 *M-x ov* 再按回车键。这个唯一字符串已经
足以告诉Emacs你要切换改写模式。自动完成功能，Emacs中最好的快捷键之一会
在第14章进一步介绍。

*Footnotes*
[fn:1] 在Mac键盘上， *Home* 键左侧的 *Help* 可以开关改写模式。
